app/controllers/question_requirements_controller.rb

  def index
    @question_requirements = QuestionRequirement.all
---
SELECT * FROM "question_requirements"

  def show
    @question_requirement = QuestionRequirement.find(params[:id])
---
SELECT * FROM "question_requirements" WHERE ("question_requirements"."id" = 1)

  def create
    @question_requirement = QuestionRequirement.new(params[:question_requirement])

    respond_to do |format|
      if @question_requirement.save
---
INSERT INTO "question_requirements" ("updated_at", "question_id", "option_id", "created_at") VALUES('2010-07-18 16:25:39', 7, 10, '2010-07-18 16:25:39')