app/controllers/surveys_controller.rb

SELECT "options".* FROM "options" INNER JOIN "question_requirements" ON "options".id = "question_requirements".option_id WHERE (("question_requirements".question_id = 7))
---
  def answer
    @survey = Survey.find(params[:id])

    @user_survey = UserSurvey.new
    @user_survey.survey=@survey
    @survey.questions.each do |q|
      if q.is_a? Question
        if q.is_a? MultipleChoiceQuestion
          @user_survey.responses<< Response.new(:question_id => q.id)
        elsif q.is_a? MultipleAnswerQuestion
          q.options.each do |o|