app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT * FROM "surveys"

  def show
    @survey = Survey.find(params[:id], :include => :questions)
---
SELECT "questions".* FROM "questions" WHERE ("questions".survey_id = 1)
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)

  def edit
    @survey = Survey.find(params[:id], :include => :questions)
---
SELECT "questions".* FROM "questions" WHERE ("questions".survey_id = 4)
SELECT * FROM "surveys" WHERE ("surveys"."id" = 4)

  def create
    @survey = Survey.new(params[:survey])

    respond_to do |format|
      if @survey.save
---
INSERT INTO "surveys" ("name", "updated_at", "owner_id", "created_at", "user_surveys_count") VALUES('Test Two', '2010-07-18 04:07:58', 1, '2010-07-18 04:07:58', 0)

  def update
    @survey = Survey.find(params[:id])

    respond_to do |format|
      if @survey.update_attributes(params[:survey])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 4)
UPDATE "surveys" SET "name" = 'Sex Survey', "updated_at" = '2010-07-18 15:11:23' WHERE "id" = 122096197

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 3)
DELETE FROM "surveys" WHERE "id" = 3

  def answer
    @survey = Survey.find(params[:id])

    @user_survey = UserSurvey.new
    @user_survey.survey=@survey
    @survey.questions.each do |q|
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
SELECT "questions".id FROM "questions" INNER JOIN "question_requirements" ON "questions".id = "question_requirements".question_id WHERE ("questions"."id" = 7) AND (("question_requirements".option_id = 8)) LIMIT 1

  def respond
    @survey = Survey.find(params[:id])
---
SELECT "user_surveys".id FROM "user_surveys" WHERE ("user_surveys"."survey_id" = 1) LIMIT 1

    scope = {}
    res = {}
    @user_survey.responses.each do |r|
      res[r.question_id]=r.option_id
      req[r.question_id]=Set.new
      scope[r.question_id] = r.question.options_required[0].question_id \
        unless r.question.options_required.count == 0
      r.question.options_required.each do |o|
        req[r.question_id]<< o.id
      end
    end
    @user_survey.responses.each do |r|
      if( (scope[r.question_id]) || \
          !(req[r.question_id].include? res[scope[r.question_id]] ) )
        r.destroy
      end
    end

    respond_to do |format|
      if @user_survey.save
---
SELECT count(*) AS count_all FROM "options" INNER JOIN "question_requirements" ON "options".id = "question_requirements".option_id WHERE (("question_requirements".question_id = 5))
SELECT "options".* FROM "options" INNER JOIN "question_requirements" ON "options".id = "question_requirements".option_id WHERE (("question_requirements".question_id = 5))
SELECT * FROM "questions" WHERE ("questions"."id" = 1)
INSERT INTO "responses" ("question_id", "user_survey_id", "option_id", "created_at") VALUES(1, 1, 1, '2010-07-18 03:38:32')
INSERT INTO "user_surveys" ("updated_at", "survey_id", "user_id", "created_at") VALUES('2010-07-18 03:38:32', 1, 1, '2010-07-18 03:38:32')
UPDATE "surveys" SET "user_surveys_count" = COALESCE("user_surveys_count", 0) + 1 WHERE ("id" = 1)